1s/ERP/Conf/InformationRegisters/Лико_ЗаказыНаРезаках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_ЗаказыНаРезаках</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗаказНаРаскрой</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лико_ЗаказНаРаскрой</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_ЗаказыНаРезаках/Ext/ManagerModule.bsl
Процедура РегистрацияНачалаРаботыСотрудника(РабочийЦентр,ЗаказНаРаскрой) Экспорт  //+Лико m.shenderov 19.08.2022
	Период=ТекущаяДата();
	
	Если ЗаказНаРаскрой <> ТекущийСотрудникНаРЦ(ЗаказНаРаскрой) Тогда
		НаборЗаписей = РегистрыСведений.Лико_ЗаказыНаРезаках.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ЗаказНаРаскрой.Установить(ЗаказНаРаскрой);
		НаборЗаписей.Отбор.Период.Установить(Период);
		Запись=НаборЗаписей.Добавить();
		Запись.Период=Период;
		Запись.ЗаказНаРаскрой=ЗаказНаРаскрой;
		НаборЗаписей.Записать(); 		
	КонецЕсли;
	
КонецПроцедуры //-Лико m.shenderov 19.08.2022


Функция ТекущийСотрудникНаРЦ(ЗаказНаРаскрой) //+Лико m.shenderov 19.08.2022
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ЗаказыНаРезакахСрезПоследних.ЗаказНаРаскрой КАК ЗаказНаРаскрой
	|ИЗ
	|	РегистрСведений.Лико_ЗаказыНаРезаках.СрезПоследних(, ЗаказНаРаскрой = &ЗаказНаРаскрой) КАК Лико_ЗаказыНаРезакахСрезПоследних";
	Запрос.УстановитьПараметр("ЗаказНаРаскрой", ЗаказНаРаскрой);
	РезультатЗапроса = Запрос.Выполнить(); 
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.ЗаказНаРаскрой;
	КонецЦикла; 
	
	
КонецФункции //-Лико m.shenderov 19.08.2022
